<a href="https://colab.research.google.com/github/anicelysantos/book-python-para-analise-de-dados/blob/main/carga_de_dados.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Lendo e escrevendo dados em formato-texto**

In [1]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv('/content/drive/MyDrive/dados_pandas/pydata-book-2nd-edition/examples/ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
pd.read_table('/content/drive/MyDrive/dados_pandas/pydata-book-2nd-edition/examples/ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [7]:
#arquivos sem cabeçalho
pd.read_csv('/content/drive/MyDrive/dados_pandas/pydata-book-2nd-edition/examples/ex2.csv', header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [8]:
#definir cabeçalho
pd.read_csv('/content/drive/MyDrive/dados_pandas/pydata-book-2nd-edition/examples/ex2.csv', names=['a','b','c','d','message'])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [10]:
names = ['a','b','c','d','message']
pd.read_csv('/content/drive/MyDrive/dados_pandas/pydata-book-2nd-edition/examples/ex2.csv', names=names, index_col='message')

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [11]:
parsed = pd.read_csv('/content/drive/MyDrive/dados_pandas/pydata-book-2nd-edition/examples/csv_mindex.csv', index_col=['key1','key2'])
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [12]:
#arquivo sem delimitador
result = pd.read_table('/content/drive/MyDrive/dados_pandas/pydata-book-2nd-edition/examples/ex3.txt', sep='\s+')
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [14]:
pd.read_csv('/content/drive/MyDrive/dados_pandas/pydata-book-2nd-edition/examples/ex4.csv', skiprows=[0,2,3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [18]:
result = pd.read_csv('/content/drive/MyDrive/dados_pandas/pydata-book-2nd-edition/examples/ex5.csv')
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [19]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [20]:
result = pd.read_csv('/content/drive/MyDrive/dados_pandas/pydata-book-2nd-edition/examples/ex5.csv', na_values=['NULL'])
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [21]:
sentinels = {'message': ['foo','NA'], 'something': ['two']}
pd.read_csv('/content/drive/MyDrive/dados_pandas/pydata-book-2nd-edition/examples/ex5.csv', na_values=sentinels)

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       NaN  5   6   NaN   8   world
2     three  9  10  11.0  12     NaN

**Lendo arquivos-texto em partes**

In [23]:
#otimizando pra exibição ser mais compacta
pd.options.display.max_rows=10

result = pd.read_csv('/content/drive/MyDrive/dados_pandas/pydata-book-2nd-edition/examples/ex6.csv')
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [24]:
#ler apenas uma quantidade de linhas específicas
pd.read_csv('/content/drive/MyDrive/dados_pandas/pydata-book-2nd-edition/examples/ex6.csv', nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [25]:
#ler arquivos em partes
chunker = pd.read_csv('/content/drive/MyDrive/dados_pandas/pydata-book-2nd-edition/examples/ex6.csv', chunksize=1000)
chunker

In [27]:
chunker = pd.read_csv('/content/drive/MyDrive/dados_pandas/pydata-book-2nd-edition/examples/ex6.csv', chunksize=1000)
tot = pd.Series([])
for piece in chunker:
  tot = tot.add(piece['key'].value_counts(), fill_value=0)
tot = tot.sort_values(ascending=False)

tot[:10]

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:2: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.

E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

**Salvando dados em formato-texto**

In [28]:
data = pd.read_csv('/content/drive/MyDrive/dados_pandas/pydata-book-2nd-edition/examples/ex5.csv')
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [29]:
#salvando com separador vígula
data.to_csv('/content/drive/MyDrive/dados_pandas/out.csv')

In [45]:
#salvando com separador barra
data.to_csv('/content/drive/MyDrive/dados_pandas/out_barra.csv', sep='|', na_rep='NULL')

In [46]:
#Salvar sem índice e sem cabeçalho
data.to_csv('/content/drive/MyDrive/dados_pandas/out_si_sh.csv', index=False, header=False)

In [51]:
#Salvando um outro conjunto de colunas
data.to_csv('/content/drive/MyDrive/dados_pandas/out_column.csv', index=False, columns=['a','b','c'])

In [52]:
pd.read_csv('/content/drive/MyDrive/dados_pandas/out_column.csv')

   a   b     c
0  1   2   3.0
1  5   6   NaN
2  9  10  11.0

In [54]:
#Salvando uma Series

dates = pd.date_range('1/1/2000', periods=7)
ts = pd.Series(np.arange(7), index=dates)
ts.to_csv('/content/drive/MyDrive/dados_pandas/tseries.csv')

**Trabalhando com formatos delimitados**

In [74]:
import csv
f = open('/content/drive/MyDrive/dados_pandas/pydata-book-2nd-edition/examples/ex7.csv')
reader = csv.reader(f)

for line in reader:
  print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [71]:
#lendo o arquivo em uma lista de linhas
with open('/content/drive/MyDrive/dados_pandas/pydata-book-2nd-edition/examples/ex7.csv') as f:
  lines = list(csv.reader(f))

#separando as linhas do cabeçalho
header, values = lines[0], lines[1:]

#transpondo as linhas para as colunas

data_dict = {h:v for h, v in zip(header, zip(*values))}

data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [76]:
#mudando o delimitador
class my_dialect(csv.Dialect):
  lineterminator = '\n'
  delimiter = ';'
  quotechar='"'
  quoting = csv.QUOTE_MINIMAL
reader = csv.reader(f, dialect=my_dialect)

In [75]:
#mudando o delimitador de um jeito mais simples
reader = csv.reader(f, delimiter='|')

In [79]:
#escrever arquivos com delimitadores manualmente
with open('mydata.csv', 'w') as f:
  writer = csv.writer(f, dialect=my_dialect)
  writer.writerow(('one', 'two', 'three'))
  writer.writerow(('1','2','3'))
  writer.writerow(('4','5','6'))
  writer.writerow(('7','8','9'))

**Dados JSON**